In [21]:
import pandas as pd
import numpy as np

In [54]:
dict1={'name':['Aravind','samar',np.nan,'siri'],
         'Age':[np.nan,20,34,21],'city':['hyb','blr','chennai',np.nan]}
dict1

{'name': ['Aravind', 'samar', nan, 'siri'],
 'Age': [nan, 20, 34, 21],
 'city': ['hyb', 'blr', 'chennai', nan]}

In [23]:
d1=pd.DataFrame(dict1)
d1

      name   Age     city
0  Aravind   NaN      hyb
1    samar  20.0      blr
2      NaN  34.0  chennai
3     siri  21.0      NaN

In [24]:
d1.dtypes

name     object
Age     float64
city     object
dtype: object

In [25]:
# you show thap np.nan is a int but dtype is takeing it as object
# so if youw want to show none at object so write
# method 2

dict2={'name':['Aravind','samar',None,'siri'],
         'Age':[np.nan,20,34,21],'city':['hyb','blr','chennai',None]}
d2=pd.DataFrame(dict2)

d2

      name   Age     city
0  Aravind   NaN      hyb
1    samar  20.0      blr
2     None  34.0  chennai
3     siri  21.0     None

In [26]:
d1.isnull()

    name    Age   city
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [81]:
d1.isnull().sum()

name    1
Age     1
city    1
dtype: int64

In [27]:
# how much percent of data is empty
d1.isnull().sum()*100/len(d1)

name    25.0
Age     25.0
city    25.0
dtype: float64

- np.nan: is not a number this is aaplicable for numerical columns only

- Generally data has some empty rows
- it is data problem
- if you read that kind of data you will see null
- you nedd to understand it is a data corrupted or really a Null values are there
- 
**Method-1**
  
**fill with some  random value**

**method name** :fill na

In [34]:
d1.fillna(40)

      name   Age     city
0  Aravind  40.0      hyb
1    samar  20.0      blr
2       40  34.0  chennai
3     siri  21.0       40

In [35]:
# every thing is filling with 40 bakwass

**method 2**
- we can fill the values w.r.t colums also # with respect to

In [36]:
d1['Age'].fillna(40)
# it will not updated becasues inplace = false

0    40.0
1    20.0
2    34.0
3    21.0
Name: Age, dtype: float64

In [37]:
d1# nan will come in age as it is nt updated

      name   Age     city
0  Aravind  40.0      hyb
1    samar  20.0      blr
2      NaN  34.0  chennai
3     siri  21.0      NaN

In [39]:
d1['Age'].fillna(40,inplace=True)# now updated

d1

      name   Age     city
0  Aravind  40.0      hyb
1    samar  20.0      blr
2      NaN  34.0  chennai
3     siri  21.0      NaN

In [42]:
d1['name'].fillna('misty',inplace=True)

In [43]:
d1

      name   Age     city
0  Aravind  40.0      hyb
1    samar  20.0      blr
2    misty  34.0  chennai
3     siri  21.0      NaN

In [44]:
dict1={'name':['Aravind','samar',np.nan,'siri'],
         'Age':[np.nan,20,34,21],'city':['hyb','blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)

**Method -3**

- bfill
- ffill
- pad
- backfill

In [45]:
d1.fillna(method='bfill')
# it will fill with below value or nect value 
# column1: name 3rd index was empty it is filled with index 4  value 
# column2:age 1st index is missing it is filled with index 2 value
# column3: city index 4 is miss it should be fill with next value 
 #but we don't have next value

C:\Users\user\AppData\Local\Temp\ipykernel_2628\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

      name   Age     city
0  Aravind  20.0      hyb
1    samar  20.0      blr
2     siri  34.0  chennai
3     siri  21.0      NaN

In [47]:
d1.fillna(method='bfill',axis=1)
# by default axis was 0 means rows so it wass filling the value w.r.t rows next value
# as we done axis =1 so it is fillin with respect to columns

C:\Users\user\AppData\Local\Temp\ipykernel_2628\981496262.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

      name   Age     city
0  Aravind   hyb      hyb
1    samar  20.0      blr
2     34.0  34.0  chennai
3     siri  21.0      NaN

In [48]:
d1.fillna(method='ffill')
## it will fill with front value 
# column1: name 3rd index was empty it is filled with index 2  value 
# column2:age 1st index is missing it is not filled as we don't as any front value
# column3: city index 4 is miss it should be fill with front value so it is filled with index 3

C:\Users\user\AppData\Local\Temp\ipykernel_2628\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

      name   Age     city
0  Aravind   NaN      hyb
1    samar  20.0      blr
2    samar  34.0  chennai
3     siri  21.0  chennai

In [49]:
d1.fillna(method='ffill',axis=1)
# it is fill w.r.t columns
# but we observe that age index1 is filled as it have front value name index1 
# but name3 index is not filled as doen;t have front value

C:\Users\user\AppData\Local\Temp\ipykernel_2628\2618984130.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill',axis=1)

      name      Age     city
0  Aravind  Aravind      hyb
1    samar     20.0      blr
2      NaN     34.0  chennai
3     siri     21.0     21.0

In [50]:
d1.fillna(method='pad')

C:\Users\user\AppData\Local\Temp\ipykernel_2628\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

      name   Age     city
0  Aravind   NaN      hyb
1    samar  20.0      blr
2    samar  34.0  chennai
3     siri  21.0  chennai

In [51]:
d1.fillna(method='pad',axis=True)

C:\Users\user\AppData\Local\Temp\ipykernel_2628\3174940658.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad',axis=True)

      name      Age     city
0  Aravind  Aravind      hyb
1    samar     20.0      blr
2      NaN     34.0  chennai
3     siri     21.0     21.0

In [52]:
d1.fillna(method='backfill')

C:\Users\user\AppData\Local\Temp\ipykernel_2628\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

      name   Age     city
0  Aravind  20.0      hyb
1    samar  20.0      blr
2     siri  34.0  chennai
3     siri  21.0      NaN

In [53]:
d1.fillna(method='backfill',axis=True)

C:\Users\user\AppData\Local\Temp\ipykernel_2628\1872297306.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill',axis=True)

      name   Age     city
0  Aravind   hyb      hyb
1    samar  20.0      blr
2     34.0  34.0  chennai
3     siri  21.0      NaN

- backfill and bfill with next value
- pad and ffill fill with previous value
- but it will change based on axis

**method 4**

**mean-median- mode**

- mean
    - nuerical values can fill with mean value
    - but we know mean affect by outliers
    - if we dont have outliers it is best one
- median
    - numerical values can fill with median values
    - it doeznot affect with outliers
    - so if outliers are ther we can go with meadian
- mode
    - it is useful for categorical data

In [55]:
dict1={'name':['Aravind','samar',np.nan,'siri'],
         'Age':[np.nan,20,34,21],'city':['hyb','blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)

In [56]:
# we already know we can fill with some values based on specific column using fillna
# d1.fillna(<random_number>) instead of random number take mean 
#d1 represent all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    25.0
1    20.0
2    34.0
3    21.0
Name: Age, dtype: float64

In [58]:
age_median= d1['Age'].median()
d1['Age'].fillna(age_median)

0    21.0
1    20.0
2    34.0
3    21.0
Name: Age, dtype: float64

In [60]:
d1['city'].mode()
# in this use case we getting mode equal
# in real time will get clear mode value

0        blr
1    chennai
2        hyb
Name: city, dtype: object

- Fill with random value
- Fill with random on specific value
- Fill eith specific methods
    - bfill
    - ffill
    - backfill
    - pad
- fill with
    - mean
    - median
    - mode

**method 5**
  
**KNN imputer**

- KNN: k nearest neighbours
- k is a hyper parameter means user can choose
- it is distance metric:**Euclidian distance**
- KNN imputer will take the mean of neighbours value
- the neigbours value can provided by using value =k
- it is under sklearn pakage
- under sklearn we have imputer method
- under imputer we have KnnImputer
- Applicable only for Numerical Data

<img id="dimg_NPmNZ4uDA4eeseMP8IG_-Qc_149" src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRuCeLMs5zHNh8RFyUwNLD9gxydDrLGuKfiqg&amp;s" class="YQ4gaf" height="186" style="object-position:37% 0%" width="270" alt="How to code kNN algorithm in R from ..." data-csiid="NPmNZ4uDA4eeseMP8IG_-Qc_74" data-atf="4" data-ilt="1737357512072" data-deferred="3" data-iml="1737357512073">

In [62]:
from sklearn.impute import KNNImputer
knn=KNNImputer()
knn.fit_transform(d1[['Age']])

array([[25.],
       [20.],
       [34.],
       [21.]])